socket-stress.yml
config:
  target: "http://localhost:3100"
  phases:
    -
      duration: 60
      arrivalRate: 5
    -
      duration: 120
      arrivalRate: 5
      rampTo: 50
    -
      duration: 600
      arrivalRate: 50
scenarios:
    -
      engine: "socketio"
      flow:
        -
          emit:
            channel: "chat send"
            data: ["dia-de-hueva", "Hola mundo!"]
        -
          think: 1
        -
          emit:
            channel: "chat send"
            data: ["dia-de-hueva", "Second round and I come out."]